app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `content`, `created_at`, `updated_at`) VALUES ('my first article', 'this is test from scaffold code', '2016-09-23 02:46:14', '2016-09-23 02:46:14')
---
  def create
    @article = Article.new(article_params)
    @article.user_id = session[:user]['id']

    respond_to do |format|
      if @article.save

UPDATE `articles` SET `content` = '<p>Axure RP首页、文档和下载 - 原型制作软件 - 开源中国社区 AxureRP 是一个快速原型制作软件，由美国Axure Software Solutions, Inc.公司开发。 Axure RP 能让操作它的人快速准确的创建基于Web的网站流程图、原型页面、交互体验 ... www.oschina.net/p/axure+rp</p>\r\n', `updated_at` = '2017-03-07 08:34:59' WHERE `articles`.`id` = 3
---
  def update
    respond_to do |format|
      if @article.update(article_params)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
---
    def set_article
      @article = Article.find(params[:id])