app/controllers/roles_controller.rb

SELECT `roles`.* FROM `roles`
SELECT `credentials`.* FROM `credentials`
---
  def index
    @roles = Role.all
    @credentials = Credential.all