app/controllers/rules_controller.rb

SELECT `rules`.* FROM `rules`
---
  def index
    @rules = Rule.all

INSERT INTO `rules` (`controller_name`, `action_name`, `created_at`, `updated_at`) VALUES ('users', 'index', '2016-10-18 09:10:52', '2016-10-18 09:10:52')
---
  def create
    @rule = Rule.new(rule_params)

    respond_to do |format|
      if @rule.save

SELECT  `rules`.* FROM `rules` WHERE `rules`.`id` = 1 LIMIT 1
---
    def set_rule
      @rule = Rule.find(params[:id])