app/controllers/users_controller.rb

  def index
    TestJob.perform_later("This is test")
    # cache_value = Rails.cache.read('permission')
    # if cache_value == nil || ''== cache_value
    #   Rails.cache.write('permission', "test")
    # end
    @users = User.paginate(:page => params[:page], :per_page => 5)
---
SELECT  `users`.* FROM `users` LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM `users`

  def create
    user_fields = user_params
    salt = User.create_random
---
INSERT INTO `users` (`name`, `age`, `avatar`, `created_at`, `updated_at`) VALUES ('testuser21', 22, '211110.jpg', '2016-10-18 03:17:31', '2016-10-18 03:17:31')

  def update
    user_fields = user_params
    if user_params['encrypt_password'] && user_params['encrypt_password'].strip != ''
      salt = User.create_random
      user_fields['encrypt_password'] = User.sha1(user_fields['encrypt_password'], salt)
      user_fields['password_salt'] = salt
    else
      user_fields.delete('encrypt_password')
      user_fields.delete('password_salt')
    end

    respond_to do |format|
      if @user.update(user_fields)
---
UPDATE `users` SET `age` = 45, `updated_at` = '2016-09-22 10:31:53' WHERE `users`.`id` = 2